app/views/passes/_form.html.erb

    <%= f.label :client %><br />
    <%= f.collection_select(:client_id, Client.all, :id, :nome) %>
---
SELECT "clients".* FROM "clients"