app/views/flies/_form.html.erb

SELECT "pilots".* FROM "pilots"
---
    <%= f.label :pilot_id %><br />
    <%= f.collection_select(:pilot_id, Pilot.all, :id, :nome) %>

SELECT "airplanes".* FROM "airplanes"
---
    <%= f.label :airplane_id %><br />
    <%= f.collection_select(:airplane_id, Airplane.all, :id, :modelo) %>