app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    @airplanes = Airplane.all

SELECT "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @airplane = Airplane.find(params[:id])

INSERT INTO "airplanes" ("capacidade", "created_at", "modelo", "updated_at") VALUES (?, ?, ?, ?)  [["capacidade", 250], ["created_at", Thu, 13 Dec 2012 02:00:06 UTC +00:00], ["modelo", "Boeing 747"], ["updated_at", Thu, 13 Dec 2012 02:00:06 UTC +00:00]]
---
  def create
    @airplane = Airplane.new(params[:airplane])

    respond_to do |format|
      if @airplane.save