app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("cidade", "created_at", "email", "endereco", "nome", "rg", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "telefone" = '(51)99463420', "updated_at" = '2012-12-13 15:41:04.282234' WHERE "clients"."id" = 1