app/controllers/flies_controller.rb

SELECT "pilots".* FROM "pilots" WHERE "pilots"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def index

    if params[:pilot_id]
      @flies = Pilot.find(params[:pilot_id]).flies
    elsif params[:airplane_id]
      @flies = Airplane.find(params[:airplane_id]).flies