app/controllers/passes_controller.rb

  def index

    if params[:fly_id]
      @passes = Fly.find(params[:fly_id]).passes
    elsif params[:client_id]
      @passes = Client.find(params[:client_id]).passes
    else
      @passes = Pass.all
---
SELECT "passes".* FROM "passes" WHERE "passes"."fly_id" = 2
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "passes".* FROM "passes" WHERE "passes"."client_id" = 1
SELECT "passes".* FROM "passes"

  def show
    @pass = Pass.find(params[:id])
---
SELECT "passes".* FROM "passes" WHERE "passes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @pass = Pass.find(params[:id])
---
SELECT "passes".* FROM "passes" WHERE "passes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @pass = Pass.new(params[:pass])

    respond_to do |format|
      if @pass.save
---
INSERT INTO "passes" ("assento", "client_id", "created_at", "fly_id", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?)  [["assento", "AD"], ["client_id", 1], ["created_at", Thu, 13 Dec 2012 02:21:25 UTC +00:00], ["fly_id", 1], ["updated_at", Thu, 13 Dec 2012 02:21:25 UTC +00:00], ["valor", 90.0]]

  def update
    @pass = Pass.find(params[:id])
---
SELECT "passes".* FROM "passes" WHERE "passes"."id" = ? LIMIT 1  [["id", "1"]]