app/controllers/pilots_controller.rb

  def index
    @pilots = Pilot.all
---
SELECT "pilots".* FROM "pilots"

  def show
    @pilot = Pilot.find(params[:id])
---
SELECT "pilots".* FROM "pilots" WHERE "pilots"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @pilot = Pilot.find(params[:id])
---
SELECT "pilots".* FROM "pilots" WHERE "pilots"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @pilot = Pilot.new(params[:pilot])

    respond_to do |format|
      if @pilot.save
---
INSERT INTO "pilots" ("created_at", "endereco", "nome", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @pilot = Pilot.find(params[:id])

    respond_to do |format|
      if @pilot.update_attributes(params[:pilot])
---
SELECT "pilots".* FROM "pilots" WHERE "pilots"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pilots" SET "telefone" = '(51)90544334', "updated_at" = '2012-12-13 15:53:24.348303' WHERE "pilots"."id" = 1